Autodesk.Revit.UI.SizingUIUtils.PresetSizeForFabricationDuctEditor(Autodesk.Revit.DB.Document,System.Double,System.Double)
Presets the size parameter for fabrication duct placement editor.
This method is for experimental use only, and may be modified or removed.
doc:
The document in which the fabrication duct is being placed.
width:
The primary width of the fabrication duct to be preset.
depth:
The primary depth of the fabrication duct to be preset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.SizingUIUtils.PresetSizeForFabricationPipeEditor(Autodesk.Revit.DB.Document,System.Double)
Presets the size parameter for fabrication pipe placement editor.
This method is for experimental use only, and may be modified or removed.
doc:
The document in which the fabrication pipe is being placed.
nominalDiameter:
The nominal diameter of the fabrication pipe to be preset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.SizingUIUtils.PresetSizeForDuctEditor(Autodesk.Revit.DB.Document,System.Double,System.Double)
Presets the size parameter for duct placement editor.
This method is for experimental use only, and may be modified or removed.
doc:
The document in which the duct is being placed.
width:
The width of the duct to be preset.
height:
The height of the duct to be preset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.SizingUIUtils.PresetSizeForPipeEditor(Autodesk.Revit.DB.Document,System.Double)
Presets the size parameter for pipe placement editor. This method is for experimental use only,
and may be modified or removed.
doc:
The document in which the pipe is being placed.
nominalDiameter:
The nominal diameter of the pipe to be preset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.SizingUIUtils
Contains the utility methods in MEP sizing operations.
Since:
2027